# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [8]:
import pandas as pd
import numpy as np
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users=pd.read_csv(url,sep='|',index_col='user_id')
#index_col='user_id'
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [9]:
users.groupby('occupation').mean().head()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [12]:
# create a function
#把性别转化成1;0
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0
# apply the function to the gender column and create a new column
users['gender_n'] = users['gender'].apply(gender_to_numeric)
users.head()

         age gender  occupation zip_code  gender_n
user_id
1         24      M  technician    85711         1
2         53      F       other    94043         0
3         23      M      writer    32067         1
4         24      M  technician    43537         1
5         33      F       other    15213         0

In [14]:
a = users.groupby('occupation').gender_n.sum()
#a为各职业中男性数量（女性为0）

In [16]:
b = users.occupation.value_counts()
#b为各职业人数

In [26]:
c = a/b*100 #c即为男性占比
c.sort_values(ascending=False).head()

doctor        100.000000
engineer       97.014925
technician     96.296296
retired        92.857143
programmer     90.909091
dtype: float64

In [27]:
#整理一下，简化代码
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0
users['gender_n'] = users['gender'].apply(gender_to_numeric)
occu_male_port = users.groupby('occupation').gender_n.sum()/users.occupation.value_counts()*100
occu_male_port.sort_values(ascending=False).head()

doctor        100.000000
engineer       97.014925
technician     96.296296
retired        92.857143
programmer     90.909091
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [30]:
#这个写法是先算了所有column的min和max再展示age
users.groupby('occupation').agg(['min','max']).age.head()
#这个写法是只计算age
users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [33]:
#两个key一定要记得加[]
users.groupby(['occupation','gender']).age.agg(['mean']).head()

                           mean
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429

### Step 8.  For each occupation present the percentage of women and men

In [36]:
# create a data frame and apply count to gender(康康对gender用count怎么写！)(计算男女数量)
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})

In [39]:
# create a DataFrame and apply count for each occupation（计算人数总量）
occup_count = users.groupby(['occupation']).agg('count')
# divide the gender_ocup per the occup_count and multiply per 100
#div函数:除，返回商，level用来matchi
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100
occup_gender.gender.head()

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
Name: gender, dtype: float64